Tekla Open API Reference for Tekla Structures 2025
InvalidAttributesForOperationException Class
 The InvalidAttributesForOperationException class defines the exception that is thrown when an object's attributes are set to something that is not valid for the object.
Inheritance Hierarchy
System.Object
 System.Exception
 System.ApplicationException
 Tekla.Structures.Drawing.TeklaStructuresDrawingsApplicationException
 Tekla.Structures.Drawing.InvalidAttributesForOperationException
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
[SerializableAttribute]
public class InvalidAttributesForOperationException : TeklaStructuresDrawingsApplicationException
<SerializableAttribute>
Public Class InvalidAttributesForOperationException
	Inherits TeklaStructuresDrawingsApplicationException
The InvalidAttributesForOperationException type exposes the following members.
Constructors
Name | Description
InvalidAttributesForOperationException
 Creates a new exception instance.
Top
See Also
Reference
Tekla.Structures.Drawing Namespace